{
  "nodes":[
		{"name":"101", "group":1, "year":"fr", "mdepth":"1", "ddepth":1,
            "title":"Introduction to Computer Science",
            "desc":"This course introduces students to some of the big ideas in computer science. It will excite students about the application of computer science to various disciplines, and show the social impact possible through the use of technology in developing regions, politics, medicine, and other fields."},
		{"name":"110", "group":1, "year":"fr", "mdepth":"1", "ddepth":1,
            "title":"Introduction to Computer Programming I",
            "desc":"An introduction to programming with an emphasis on solving problems drawn from a variety of domains. Topics include basic control and data structures, problem solving strategies, and software development tools and techniques."},
		{"name":"120", "group":2, "year":"fr", "mdepth":"2", "ddepth":2,
            "title":"Introduction to Computer Programming II",
            "desc":"Provides a continuing introduction to programming with an emphasis on problem­solving. It considers problems drawn from a variety of domains (including Computer Science) and emphasizes both the broader applicability of the relevant data structures and programming concepts, as well as the implementation of those structures and concepts in software. Topics include arrays, lists, stacks, queues, trees, searching and sorting, and exceptions."},
		{"name":"245", "group":3, "year":"so", "mdepth":"3", "ddepth":3,
            "title":"Introduction to Discrete Structures",
            "desc":"An introduction to mathematical concepts for Computer Science. Topics include first-order logic and logical arguments, proof techniques with an emphasis on mathematical induction, sets, relations and functions, properties of integers, counting methods, probability, and recurrences. Weekly laboratory."},
		{"name":"210", "group":3, "year":"so", "mdepth":"3", "ddepth":3,
            "title":"Software Development",
            "desc":"An introduction to the development of large­ scale software. Topics include modularization, design patterns, documentation, unit testing, source code control, build systems, debuggers, and performance tuning; all of the tools necessary for developing software as opposed to writing small programs."},
		{"name":"345", "group":4, "year":"jr", "mdepth":"4", "ddepth":4,
            "title":"Analysis of Discrete Structures",
            "desc":"Introduction to and analysis of algorithms and characteristics of discrete structures. Course topics include algorithm analysis techniques, recurrence relations, structural induction, hierarchical structures, graphs, hashing, and sorting."},
		{"name":"445", "group":4, "year":"sr", "mdepth":"6", "ddepth":6,
            "title":"Algorithms",
            "desc":"Introduction to the design and analysis of algorithms: basic analysis techniques (asymptotics, sums, recurrences); basic design techniques (divide and conquer, dynamic programming, greedy, amortization); acquiring an algorithm repertoire (sorting, median finding, strong components, spanning trees, shortest paths, maximum flow, string matching); and handling intractability (approximation algorithms, branch and bound)."},
		{"name":"352", "group":4, "year":"jr", "mdepth":"5", "ddepth":5,
            "title":"Systems Programming and Unix",
            "desc":"Programming in C, including single and multi-dimensional arrays, lists, stacks, queues, trees, and bit manipulation. Unix topics, including debuggers, makefiles, shell programming, and other topics that support systems programming."},
		{"name":"252", "group":4, "year":"so", "mdepth":"4", "ddepth":4,
            "title":"Computer Organization",
            "desc":"Basic machine organization; elementary hardware concepts; CPU internals. Machine operations and instructions; assembly language concepts and programming."},
		{"name":"452", "group":4, "year":"sr", "mdepth":"6", "ddepth":6,
            "title":"Principles of Operating Systems",
            "desc":"Concepts of modern operating systems; concurrent processes; process synchronization and communication; resource allocation; kernels; deadlock; memory management; file systems."},
		{"name":"473", "group":4, "year":"sr", "mdepth":"6", "ddepth":6,
            "title":"Automata, Grammars, and Languages",
            "desc":"Introduction to models of computation (finite automata, pushdown automata, Turing machines), representations of languages (regular expressions, context-free grammars), and the basic hierarchy of languages (regular, context-free, decidable, and undecidable languages)."},
		{"name":"453", "group":4, "year":"sr", "mdepth":"6", "ddepth":6,
            "title":"Compilers and Systems Software",
            "desc":"Basic concepts of compilation and related systems software. Topics include lexical analysis, parsing, semantic analysis, code generation; assemblers, loaders, linkers; debuggers."},
		{"name":"335", "group":4, "year":"jr", "mdepth":"4", "ddepth":4,
            "title":"Object-Oriented Programming and Design",
            "desc":"Fundamentals of object-oriented software development. Includes design principles, inheritance, polymorphism, Unified Modeling Language (UML), testing, event-driven programming with graphical user interfaces, applications of design patterns, and use of existing frameworks. Weekly laboratory."},
		{"name":"460", "group":4, "year":"sr", "mdepth":"6", "ddepth":6,
            "title":"Database Design",
            "desc":"Functions of a database system. Data modeling and logical database design. Query languages and query optimization. Efficient data storage and access. Database access through standalone and web applications."},
		{"name":"444", "group":4, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Data Visualization",
            "desc":"This course will present the fundamentals of data visualization, the art and science of using a computer to generate visual depictions of data. The course will present the foundations of graphic design, perceptual psychology and cognitive science, as well as the algorithmic basis for many for the visualization techniques. While statistical techniques may determine correlations among the data, visualization helps us frame what questions to ask. The course is targeted at students looking for effective ways of understanding data from their own fields, as well as students interested in learning the fundamentals that will enable them to build and improve the state of the art. The successful student will learn to design, critique and improve data visualizations."},
		{"name":"337", "group":4, "year":"jr", "mdepth":"2", "ddepth":2,
            "title":"Web Programming",
            "desc":"Introduction to the techniques and technologies for developing dynamic web sites. Topics include a web server, PHP as the server-side scripting language, the MySQL database, JavaScript and AJAX for enriching web services, and page layout with HTML and CSS. Security concerns will be considered with details for prevention of such vulnerabilities in web applications. This course includes a team project to deploy a dynamic website. Weekly laboratory."},
		{"name":"372", "group":4, "year":"jr", "mdepth":"4", "ddepth":4,
            "title":"Comparative Programming Languages",
            "desc":"Introduction to several major high-level programming languages and their characteristics. Programming projects are required in at least three languages."},
		{"name":"346", "group":4, "year":"jr", "mdepth":"3", "ddepth":3,
            "title":"Cloud Computing",
            "desc":"This course focuses on cloud programming, with an emphasis on using the cloud to solve Big Data problems. The course will not only look at how distributed systems, databases, networks, etc. are used to implement cloud computing platforms and cloud applications, but also the impact of the infinite scalability and pay-as-you-go on the platforms and applications."},
		{"name":"422", "group":4, "year":"sr", "mdepth":"6", "ddepth":6,
            "title":"Introduction to Parallel and Distributed Programming",
            "desc":"Concepts and applications of parallel and distributed programs. Process interaction using shared variables and message passing; parallel computing; development of correct programs; general problem solving techniques; scientific computing; distributed systems. Programming assignments on multiple processor machines."},
		{"name":"250", "group":1, "year":"so", "mdepth":"1", "ddepth":1,
            "title":"Essential Computing for the Sciences",
            "desc":"This course teaches essential computing skills for students in scientific disciplines. No prior background in programming is required. The content focuses on three computational skills: (i) basic programming in a scripting language such as Python, and knowledge of its supported data structures; (ii) facility with the UNIX operating system environment, including file structure, regular expressions, and job control; (iii) essential database skills, including database accession and interfacing through the SQL query language.This course teaches essential computing skills for students in scientific disciplines. No prior background in programming is required. The content focuses on three computational skills: (i) basic programming in a scripting language such as Python, and knowledge of its supported data structures; (ii) facility with the UNIX operating system environment, including file structure, regular expressions, and job control; (iii) essential database skills, including database accession and interfacing through the SQL query language."},
		{"name":"317", "group":4, "year":"jr", "mdepth":"4", "ddepth":4,
            "title":"Mobile Application Programming",
            "desc":"Students will learn how to develop applications for mobile devices. The course will cover the necessary programming language(s), development environment, and a number of platform-specific APIs commonly used in mobile applications such as maps, location services, notifications, camera, and local storage. Other mobile-specific software development topics will be considered such as programming with limited computational and battery resources, client/server architecture, and cloud synchronization."},
		{"name":"483", "group":7, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Text Retreival and Web Search",
            "desc":"Most of the web data today consists of unstructured text. Of course, the fact that this data exists is irrelevant, unless it is made available such that users can quickly find information that is relevant for their needs. This course will cover the fundamental knowledge necessary to build these systems, such as web crawling, index construction and compression, Boolean, vector-based, and probabilistic retrieval models, text classification and clustering, link analysis algorithms such as PageRank, and computational advertising. The students will also complete one programming project, in which they will construct one complex application that combines multiple algorithms into a system that solves real-world problems."},
		{"name":"477", "group":5, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Computer Vision",
            "desc":"Overview of algorithms for analyzing image data. Topics include image formation, physics-based vision, linear filtering, edge detection, multiple view geometry, segmentation, tracking, and recognition. (Linear Algebra Required)"},
		{"name":"466", "group":5, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Computer Security",
            "desc":"This is an introductory course covering the fundamentals of computer security. In particular, the course will cover basic concepts of computer security such as threat models and security policies, and will show how these concepts apply to specific areas such as communication security, software security, operating systems security, network security, web security, and hardware-based security."},
		{"name":"450", "group":5, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Algorithms In Bioinformatics",
            "desc":"This course introduces fundamental results in discrete algorithms for combinatorial problems in bioinformatics and computational biology. The emphasis is on realistic models of computational problems that arise in the analysis of biological data, and practical algorithms for their solution. The content has depth in the area of biological sequence analysis, and breadth in areas such as phylogeny construction, protein structure prediction, and genome rearrangement analysis. Grades are based on homeworks, exams, programming projects, and a class presentation."},
		{"name":"447", "group":5, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Green Computing",
            "desc":"This course covers fundamental principles of energy management faced by designers of hardware, operating systems, and data centers. We will explore basic energy management option in individual components such as CPUs, network interfaces, hard drives, memory. We will further present the energy management policies at the operating system level that consider performance vs. energy saving tradeoffs. Finally we will consider large scale data centers where energy management is done at multiple layers from individual components in the system to shutting down entries subset of machines. We will also discuss energy generation and delivery and well as cooling issues in large data centers. In addition to the assignments listed for undergraduates,"},
		{"name":"437", "group":5, "year":"sr", "mdepth":"6", "ddepth":6,
            "title":"Geometric Algorithms",
            "desc":"The study of algorithms for geometric objects, using a computational geometry approach, with an emphasis on applications for graphics, VLSI, GIS, robotics, and sensor networks. Topics may include the representation and overlaying of maps, finding nearest neighbors, solving linear programming problems, and searching geometric databases."},
		{"name":"436", "group":5, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Software Engineering",
            "desc":"Introduces fundamental software engineering techniques for developing correct, efficient, reliable, maintainable, and evolvable software for large software projects. The class project gives an experience in using evolutionary software development processes for developing a high-quality, evolvable software product that addresses emerging customer requirements."},
		{"name":"433", "group":5, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Computer Graphics",
            "desc":"Theory and practice of computer graphics: basic graphics programming, 2D and 3D transformations, clipping, 2D and 3D viewing, hierarchical modeling, hidden surface removal, lighting and shading, color, ray-tracing, radiosity, curve and surface modeling, and animation. (Linear algebra also required)"},
		{"name":"425", "group":5, "year":"sr", "mdepth":"7", "ddepth":7,
            "title":"Computer Networking",
            "desc":"Theory and practice of computer networks, emphasizing the principles underlying the design of network software and the role of the communications system in distributed computing. Topics include routing, flow and congestion control, end-to-end protocols, and multicast.Grading basis: Regular Grade.s"}
	],
	"links":[
     {"source":0, "target":1},
    {"source":1, "target":2},
    {"source":2, "target":3},
    {"source":2, "target":4},
    {"source":3, "target":5},
    {"source":4, "target":5},
    {"source":5, "target":6},
    {"source":5, "target":10},
    {"source":8, "target":7},
    {"source":7, "target":9},
    {"source":5, "target":9},
    {"source":5, "target":11},
    {"source":7, "target":11},
    {"source":4, "target":12},
    {"source":12, "target":13},
    {"source":5, "target":13},
    {"source":12, "target":14},
    {"source":5, "target":14},
    {"source":1, "target":15},
    {"source":4, "target":16},
    {"source":2, "target":17},
    {"source":7, "target":18},
    {"source":5, "target":18},
    {"source":3, "target":8},
    {"source":4, "target":20},
    {"source":5, "target":21},
    {"source":5, "target":22},
    {"source":7, "target":22},
    {"source":12, "target":22},
    {"source":7, "target":23},
    {"source":8, "target":23},
    {"source":5, "target":24},
    {"source":7, "target":25},
    {"source":8, "target":25},
    {"source":5, "target":26},
    {"source":5, "target":27},
    {"source":7, "target":27},
    {"source":8, "target":27},
    {"source":12, "target":27},
    {"source":5, "target":28},
    {"source":7, "target":28},
    {"source":12, "target":28},
    {"source":7, "target":29},
    {"source":8, "target":29}
	]

}
